{"node": "root", "content": "PSYCHOTIC PATIENT", "children": [{"node": "A", "content": "Ensure safety of patient and others. Restrain if necessary", "children": [{"node": "B", "content": "History (Usually from family and significant others). Physical examination may require restraint of patient. Indicated laboratory tests", "children": [{"node": "C", "content": "Consider metabolic, neurologic, or toxic etiology: Hypoglycemia, Electrolyte or endocrine dysfunction, Seizure disorder, Intracranial bleeding, Cerebral tumor, Drug intoxication", "children": [{"node": "Organic cause found", "content": null, "children": [{"node": "D", "content": "Treat condition as appropriate. Place patient in secure setting. Sedate if necessary. Diminish stimuli"}]}, {"node": "No organic cause found", "content": null, "children": [{"node": "E", "content": "Psychiatric differential diagnosis (by history and mental status examination)", "children": [{"node": "F", "content": "Schizophrenia", "children": [{"node": null, "content": "Chronic course. Usually begins in adolescence. Behavior never returns to normal. Bizarre thoughts and behavior, often suspicious. Social awkwardness even when not psychotic", "children": [{"node": null, "content": "Acute Treatment with Antipsychotic Drugs and Benzodiazepines for Sedation"}, {"node": null, "content": "Maintenance Therapy with Same Agents at Lower Dosages"}]}]}, {"node": "G", "content": "Acute mania", "children": [{"node": null, "content": "History of previous episodes of mania and depression with intervening periods of normalcy. Excited behavior, overtalkative and pressured speech. Grandiose delusions. Hypersexuality", "children": [{"node": null, "content": "Antipsychotic Drugs, Probably Lithium (Usually Effective in Maintenance Therapy), or Possibly Other Anticonvulsants (e.g., Divalproex) Often Adjunctive Benzodiazepines"}, {"node": null, "content": "Consider: ECT, Benzodiazepines"}]}]}, {"node": "H", "content": "Psychotic depression", "children": [{"node": null, "content": "History of previous mood episodes. Intervening periods of normalcy. Hallucinations and delusions consistent with depressive themes", "children": [{"node": null, "content": "Consider: ECT, Combined antipsychotic and antidepressant, Clozapine and perhaps other newer antipsychotic drugs"}]}]}, {"node": "I", "content": "Delusional disorder", "children": [{"node": null, "content": "Usually chronic. Thinking may be intact except for fixed, usually paranoid delusion", "children": [{"node": null, "content": "Usually difficult to treat"}]}]}, {"node": "J", "content": "Dementia", "children": [{"node": null, "content": "Diagnosis established", "children": [{"node": null, "content": "If possible, manage behaviorally: Low stimulation, Consistent environment"}, {"node": null, "content": "Consider low dosages of antipsychotics"}]}]}]}]}]}]}]}]}